Revit 2027 API
UnitUtils.IsValidUnit Method
 Checks whether a unit is valid for a given measurable spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidUnit(
	ForgeTypeId specTypeId,
	ForgeTypeId unitTypeId
)
Public Shared Function IsValidUnit (
	specTypeId As ForgeTypeId,
	unitTypeId As ForgeTypeId
) As Boolean
public:
static bool IsValidUnit(
	ForgeTypeId^ specTypeId,
	ForgeTypeId^ unitTypeId
)
static member IsValidUnit :
        specTypeId : ForgeTypeId *
        unitTypeId : ForgeTypeId -> bool
Parameters
specTypeId ForgeTypeId
 Identifier of the measurable spec.
unitTypeId ForgeTypeId
 Identifier of the unit to check.
Return Value
Boolean
 True if the unit is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace